# How do I find and remove duplicate rows in pandas?

üêº Tuto on pandas by Data School - Exercice performed by Dorian.H Mekni ü•á | Tue 15 Dec 2020


‚≠êÔ∏è Let's count the number of duplicate rows

In [12]:
import pandas as pd

In [13]:
# read a dataset of movie reviewers (modifying the default parameter values for read_table)
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols)

In [14]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [15]:
users.shape

(943, 5)


‚≠êÔ∏è Let's identify duplicate zip codes.

In [16]:
users.zip_code.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
938    False
939     True
940    False
941    False
942    False
Name: zip_code, Length: 943, dtype: bool


‚úÖ Booleans shows True for whichever row is a duplicate.

In [17]:
# Let's counts the number of duplicates :
users.zip_code.duplicated().sum()

148

In [20]:
users.loc[users.zip_code.duplicated(), :]

     user_id  age gender     occupation zip_code
28        29   41      M     programmer    94043
51        52   18      F        student    55105
55        56   25      M      librarian    46260
83        84   32      M      executive    55369
91        92   32      M  entertainment    80525
..       ...  ...    ...            ...      ...
927      928   21      M        student    55408
928      929   44      M      scientist    53711
933      934   61      M       engineer    22902
936      937   48      M       educator    98072
939      940   32      M  administrator    02215

[148 rows x 5 columns]

In [21]:
# Keep is set to true as a default value
users.loc[users.zip_code.duplicated(keep='first'), :]

     user_id  age gender     occupation zip_code
28        29   41      M     programmer    94043
51        52   18      F        student    55105
55        56   25      M      librarian    46260
83        84   32      M      executive    55369
91        92   32      M  entertainment    80525
..       ...  ...    ...            ...      ...
927      928   21      M        student    55408
928      929   44      M      scientist    53711
933      934   61      M       engineer    22902
936      937   48      M       educator    98072
939      940   32      M  administrator    02215

[148 rows x 5 columns]


‚òùüèª The first occurence gets kept all other in the dataframe get identified as duplicated.

In [22]:
# Let's now reverse the logic and set keep to last : 
users.loc[users.zip_code.duplicated(keep='last'), :]

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
6          7   57      M  administrator    91344
13        14   45      M      scientist    55106
14        15   49      F       educator    97301
..       ...  ...    ...            ...      ...
799      800   25      M     programmer    55337
803      804   39      M       educator    61820
809      810   55      F          other    80526
853      854   29      F        student    55408
878      879   33      F  administrator    55337

[148 rows x 5 columns]

In [23]:
# Third option : 
users.loc[users.zip_code.duplicated(keep=False), :]

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
6          7   57      M  administrator    91344
13        14   45      M      scientist    55106
14        15   49      F       educator    97301
..       ...  ...    ...            ...      ...
927      928   21      M        student    55408
928      929   44      M      scientist    53711
933      934   61      M       engineer    22902
936      937   48      M       educator    98072
939      940   32      M  administrator    02215

[250 rows x 5 columns]


‚òùüèª That asks pandas to show all duplicates as True so that they will show up when we use the loc method.

In [26]:
# Let's drop the 'first' version of the duplicates :
users.zip_code.drop_duplicates(keep='first').shape

(795,)

In [27]:
# Let's drop the 'last' version of the duplicates :
users.zip_code.drop_duplicates(keep='last').shape

(795,)

In [28]:
# Let's drop both versions : 
users.zip_code.drop_duplicates(keep=False).shape

(693,)

# üé© Bonus tips : iPython | Jupyter Notebook ONLY


ü§† We only want to identify certain columns when you identify duplicates :


‚≠êÔ∏è Let's prentend here that age and zip code should be unique identifiers in this dataframe :

In [29]:
users.duplicated(subset=['age', 'zip_code']).sum()

16


üßê If only considering these two columns, they are 16 duplicates.

In [30]:
# Let's now read the shape dataframe with the two column we have identified : 
users.drop_duplicates(subset=['age', 'zip_code']).shape

(927, 5)


‚úÖ Thus the 16 rows we had identified get dropped.


üôèüèª Thank you !

üëãüèª See you in the next one !